* data statistics
** key

list of categories: http://arxitics.com/help/categories

** general
*** data timespan

04-1986 to 12-2018 (limited number of articles prior to 1991)

~32 years  
392 months

** text
*** total number of articles
- arXiv.org: 1,495,708 [2019-02-04 Mon]
- metadata->sqlite: 1,506,177 [2019-04-12 Fri] (metadata downloaded on [2019-03-06 Wed])
- number of folders below the year/month folders: 1476538 [2019-03-05 Tue]

#+BEGIN_SRC bash
# find all directories at a particular depth below year/month
find . -type d  -mindepth 2 -maxdepth 2 | wc -l
#+END_SRC

*** number of pdf only articles
# [2019-02-05 Tue]

114132

(7.69% of total articles)

#+BEGIN_SRC bash
# find all pdf files
find . -name "*.pdf" | wc -l 
#+END_SRC

*** number of text files extracted from pdfs

114131

*** number of articles that include source (generally in TeX or LaTeX format)

1369530  
(includes source-only, i.e. no images)

*** number of source-only articles (single source file only)

324101 

#+BEGIN_SRC bash
# command to find all .gz files
find . -type f -name "*.gz" | wc -l
# would now need a more complex command to check for this, gz files have been extracted
#+END_SRC

*** total number of characters of text files

*** different formats of text files

*** articles by month/year
# [2019-04-17 Wed]

| no. |   month | total |
|-----+---------+-------|
|   1 | 04-1986 |     1 |
|   2 | 11-1988 |     1 |
|   3 | 04-1989 |     1 |
|   4 | 10-1989 |     3 |
|   5 | 11-1989 |     2 |
|   6 | 12-1989 |     2 |
|   7 | 01-1990 |     4 |
|   8 | 02-1990 |     2 |
|   9 | 03-1990 |     3 |
|  10 | 04-1990 |     1 |
|  11 | 05-1990 |     2 |
|  12 | 06-1990 |     2 |
|  13 | 07-1990 |     2 |
|  14 | 08-1990 |     1 |
|  15 | 09-1990 |     4 |
|  16 | 11-1990 |     1 |
|  17 | 12-1990 |     3 |
|  18 | 01-1991 |     9 |
|  19 | 02-1991 |     3 |
|  20 | 03-1991 |     3 |
|  21 | 04-1991 |     4 |
|  22 | 05-1991 |     4 |
|  23 | 06-1991 |     5 |
|  24 | 07-1991 |     5 |
|  25 | 08-1991 |    29 |
|  26 | 09-1991 |    61 |
|  27 | 10-1991 |    83 |
|  28 | 11-1991 |    67 |
|  29 | 12-1991 |    97 |
|  30 | 01-1992 |    93 |
|  31 | 02-1992 |   129 |
|  32 | 03-1992 |   140 |
|  33 | 04-1992 |   221 |
|  34 | 05-1992 |   234 |
|  35 | 06-1992 |   250 |
|  36 | 07-1992 |   285 |
|  37 | 08-1992 |   231 |
|  38 | 09-1992 |   349 |
|  39 | 10-1992 |   384 |
|  40 | 11-1992 |   453 |
|  41 | 12-1992 |   412 |
|  42 | 01-1993 |   370 |
|  43 | 02-1993 |   435 |
|  44 | 03-1993 |   514 |
|  45 | 04-1993 |   497 |
|  46 | 05-1993 |   540 |
|  47 | 06-1993 |   549 |
|  48 | 07-1993 |   632 |
|  49 | 08-1993 |   546 |
|  50 | 09-1993 |   529 |
|  51 | 10-1993 |   663 |
|  52 | 11-1993 |   718 |
|  53 | 12-1993 |   735 |
|  54 | 01-1994 |   611 |
|  55 | 02-1994 |   655 |
|  56 | 03-1994 |   753 |
|  57 | 04-1994 |   714 |
|  58 | 05-1994 |   852 |
|  59 | 06-1994 |   895 |
|  60 | 07-1994 |   849 |
|  61 | 08-1994 |   764 |
|  62 | 09-1994 |   888 |
|  63 | 10-1994 |   935 |
|  64 | 11-1994 |  1111 |
|  65 | 12-1994 |  1058 |
|  66 | 01-1995 |   915 |
|  67 | 02-1995 |   983 |
|  68 | 03-1995 |  1152 |
|  69 | 04-1995 |   933 |
|  70 | 05-1995 |  1105 |
|  71 | 06-1995 |  1163 |
|  72 | 07-1995 |  1048 |
|  73 | 08-1995 |  1033 |
|  74 | 09-1995 |  1102 |
|  75 | 10-1995 |  1242 |
|  76 | 11-1995 |  1183 |
|  77 | 12-1995 |  1135 |
|  78 | 01-1996 |  1050 |
|  79 | 02-1996 |  1081 |
|  80 | 03-1996 |  1159 |
|  81 | 04-1996 |  1222 |
|  82 | 05-1996 |  1326 |
|  83 | 06-1996 |  1347 |
|  84 | 07-1996 |  1426 |
|  85 | 08-1996 |  1461 |
|  86 | 09-1996 |  1425 |
|  87 | 10-1996 |  1508 |
|  88 | 11-1996 |  1461 |
|  89 | 12-1996 |  1409 |
|  90 | 01-1997 |  1366 |
|  91 | 02-1997 |  1336 |
|  92 | 03-1997 |  1379 |
|  93 | 04-1997 |  1470 |
|  94 | 05-1997 |  1580 |
|  95 | 06-1997 |  1707 |
|  96 | 07-1997 |  1791 |
|  97 | 08-1997 |  1446 |
|  98 | 09-1997 |  1854 |
|  99 | 10-1997 |  2019 |
| 100 | 11-1997 |  1767 |
| 101 | 12-1997 |  1906 |
| 102 | 01-1998 |  1734 |
| 103 | 02-1998 |  1667 |
| 104 | 03-1998 |  1913 |
| 105 | 04-1998 |  1725 |
| 106 | 05-1998 |  1962 |
| 107 | 06-1998 |  2065 |
| 108 | 07-1998 |  2082 |
| 109 | 08-1998 |  1832 |
| 110 | 09-1998 |  2424 |
| 111 | 10-1998 |  2352 |
| 112 | 11-1998 |  2222 |
| 113 | 12-1998 |  2196 |
| 114 | 01-1999 |  1876 |
| 115 | 02-1999 |  1938 |
| 116 | 03-1999 |  2357 |
| 117 | 04-1999 |  2147 |
| 118 | 05-1999 |  2215 |
| 119 | 06-1999 |  2452 |
| 120 | 07-1999 |  2415 |
| 121 | 08-1999 |  2125 |
| 122 | 09-1999 |  2484 |
| 123 | 10-1999 |  2484 |
| 124 | 11-1999 |  2618 |
| 125 | 12-1999 |  2583 |
| 126 | 01-2000 |  2368 |
| 127 | 02-2000 |  2358 |
| 128 | 03-2000 |  2602 |
| 129 | 04-2000 |  2131 |
| 130 | 05-2000 |  2679 |
| 131 | 06-2000 |  2431 |
| 132 | 07-2000 |  2460 |
| 133 | 08-2000 |  2613 |
| 134 | 09-2000 |  2550 |
| 135 | 10-2000 |  2904 |
| 136 | 11-2000 |  2848 |
| 137 | 12-2000 |  2728 |
| 138 | 01-2001 |  2514 |
| 139 | 02-2001 |  2435 |
| 140 | 03-2001 |  2744 |
| 141 | 04-2001 |  2576 |
| 142 | 05-2001 |  2909 |
| 143 | 06-2001 |  2893 |
| 144 | 07-2001 |  2729 |
| 145 | 08-2001 |  2422 |
| 146 | 09-2001 |  2612 |
| 147 | 10-2001 |  3365 |
| 148 | 11-2001 |  3225 |
| 149 | 12-2001 |  2703 |
| 150 | 01-2002 |  2731 |
| 151 | 02-2002 |  2559 |
| 152 | 03-2002 |  2707 |
| 153 | 04-2002 |  2811 |
| 154 | 05-2002 |  3083 |
| 155 | 06-2002 |  2753 |
| 156 | 07-2002 |  3229 |
| 157 | 08-2002 |  2736 |
| 158 | 09-2002 |  3291 |
| 159 | 10-2002 |  3536 |
| 160 | 11-2002 |  3478 |
| 161 | 12-2002 |  3188 |
| 162 | 01-2003 |  2931 |
| 163 | 02-2003 |  2880 |
| 164 | 03-2003 |  3023 |
| 165 | 04-2003 |  3139 |
| 166 | 05-2003 |  3282 |
| 167 | 06-2003 |  3414 |
| 168 | 07-2003 |  3420 |
| 169 | 08-2003 |  2815 |
| 170 | 09-2003 |  3675 |
| 171 | 10-2003 |  3818 |
| 172 | 11-2003 |  3432 |
| 173 | 12-2003 |  3560 |
| 174 | 01-2004 |  3113 |
| 175 | 02-2004 |  3326 |
| 176 | 03-2004 |  3531 |
| 177 | 04-2004 |  3355 |
| 178 | 05-2004 |  3559 |
| 179 | 06-2004 |  3723 |
| 180 | 07-2004 |  3697 |
| 181 | 08-2004 |  3277 |
| 182 | 09-2004 |  3931 |
| 183 | 10-2004 |  4156 |
| 184 | 11-2004 |  4069 |
| 185 | 12-2004 |  3981 |
| 186 | 01-2005 |  3509 |
| 187 | 02-2005 |  3235 |
| 188 | 03-2005 |  3893 |
| 189 | 04-2005 |  3715 |
| 190 | 05-2005 |  3745 |
| 191 | 06-2005 |  3992 |
| 192 | 07-2005 |  3916 |
| 193 | 08-2005 |  3700 |
| 194 | 09-2005 |  4343 |
| 195 | 10-2005 |  4423 |
| 196 | 11-2005 |  4295 |
| 197 | 12-2005 |  4096 |
| 198 | 01-2006 |  3830 |
| 199 | 02-2006 |  3528 |
| 200 | 03-2006 |  4190 |
| 201 | 04-2006 |  3586 |
| 202 | 05-2006 |  4143 |
| 203 | 06-2006 |  4098 |
| 204 | 07-2006 |  4208 |
| 205 | 08-2006 |  4068 |
| 206 | 09-2006 |  4335 |
| 207 | 10-2006 |  5072 |
| 208 | 11-2006 |  4873 |
| 209 | 12-2006 |  4371 |
| 210 | 01-2007 |  4555 |
| 211 | 02-2007 |  4169 |
| 212 | 03-2007 |  4492 |
| 213 | 04-2007 |  4016 |
| 214 | 05-2007 |  4677 |
| 215 | 06-2007 |  4513 |
| 216 | 07-2007 |  4657 |
| 217 | 08-2007 |  4385 |
| 218 | 09-2007 |  4840 |
| 219 | 10-2007 |  5811 |
| 220 | 11-2007 |  5018 |
| 221 | 12-2007 |  4635 |
| 222 | 01-2008 |  4748 |
| 223 | 02-2008 |  4455 |
| 224 | 03-2008 |  4533 |
| 225 | 04-2008 |  4891 |
| 226 | 05-2008 |  4894 |
| 227 | 06-2008 |  4929 |
| 228 | 07-2008 |  5135 |
| 229 | 08-2008 |  4264 |
| 230 | 09-2008 |  5193 |
| 231 | 10-2008 |  5759 |
| 232 | 11-2008 |  4916 |
| 233 | 12-2008 |  5078 |
| 234 | 01-2009 |  4906 |
| 235 | 02-2009 |  4932 |
| 236 | 03-2009 |  5484 |
| 237 | 04-2009 |  4921 |
| 238 | 05-2009 |  5095 |
| 239 | 06-2009 |  5487 |
| 240 | 07-2009 |  5585 |
| 241 | 08-2009 |  4638 |
| 242 | 09-2009 |  5688 |
| 243 | 10-2009 |  6004 |
| 244 | 11-2009 |  5678 |
| 245 | 12-2009 |  5658 |
| 246 | 01-2010 |  5456 |
| 247 | 02-2010 |  5101 |
| 248 | 03-2010 |  5981 |
| 249 | 04-2010 |  5598 |
| 250 | 05-2010 |  5738 |
| 251 | 06-2010 |  5972 |
| 252 | 07-2010 |  5603 |
| 253 | 08-2010 |  5344 |
| 254 | 09-2010 |  6200 |
| 255 | 10-2010 |  6486 |
| 256 | 11-2010 |  6525 |
| 257 | 12-2010 |  6279 |
| 258 | 01-2011 |  5828 |
| 259 | 02-2011 |  5779 |
| 260 | 03-2011 |  6286 |
| 261 | 04-2011 |  5769 |
| 262 | 05-2011 |  6313 |
| 263 | 06-2011 |  6371 |
| 264 | 07-2011 |  6184 |
| 265 | 08-2011 |  6199 |
| 266 | 09-2011 |  6909 |
| 267 | 10-2011 |  6964 |
| 268 | 11-2011 |  7306 |
| 269 | 12-2011 |  6696 |
| 270 | 01-2012 |  6451 |
| 271 | 02-2012 |  6716 |
| 272 | 03-2012 |  6989 |
| 273 | 04-2012 |  6657 |
| 274 | 05-2012 |  7043 |
| 275 | 06-2012 |  7194 |
| 276 | 07-2012 |  7287 |
| 277 | 08-2012 |  6557 |
| 278 | 09-2012 |  6849 |
| 279 | 10-2012 |  8328 |
| 280 | 11-2012 |  7340 |
| 281 | 12-2012 |  6973 |
| 282 | 01-2013 |  7717 |
| 283 | 02-2013 |  7297 |
| 284 | 03-2013 |  8001 |
| 285 | 04-2013 |  7618 |
| 286 | 05-2013 |  7507 |
| 287 | 06-2013 |  7159 |
| 288 | 07-2013 |  8261 |
| 289 | 08-2013 |  6936 |
| 290 | 09-2013 |  7977 |
| 291 | 10-2013 |  8592 |
| 292 | 11-2013 |  7818 |
| 293 | 12-2013 |  7981 |
| 294 | 01-2014 |  8061 |
| 295 | 02-2014 |  7415 |
| 296 | 03-2014 |  8243 |
| 297 | 04-2014 |  7842 |
| 298 | 05-2014 |  7942 |
| 299 | 06-2014 |  7841 |
| 300 | 07-2014 |  8520 |
| 301 | 08-2014 |  7351 |
| 302 | 09-2014 |  8514 |
| 303 | 10-2014 |  8841 |
| 304 | 11-2014 |  8324 |
| 305 | 12-2014 |  8696 |
| 306 | 01-2015 |  7896 |
| 307 | 02-2015 |  8003 |
| 308 | 03-2015 |  9017 |
| 309 | 04-2015 |  8361 |
| 310 | 05-2015 |  8431 |
| 311 | 06-2015 |  8974 |
| 312 | 07-2015 |  8987 |
| 313 | 08-2015 |  8027 |
| 314 | 09-2015 |  9310 |
| 315 | 10-2015 |  9365 |
| 316 | 11-2015 |  9464 |
| 317 | 12-2015 |  9280 |
| 318 | 01-2016 |  8623 |
| 319 | 02-2016 |  8888 |
| 320 | 03-2016 |  9711 |
| 321 | 04-2016 |  8991 |
| 322 | 05-2016 |  9732 |
| 323 | 06-2016 |  9570 |
| 324 | 07-2016 |  9106 |
| 325 | 08-2016 |  8794 |
| 326 | 09-2016 |  9857 |
| 327 | 10-2016 | 10100 |
| 328 | 11-2016 | 10374 |
| 329 | 12-2016 |  9665 |
| 330 | 01-2017 |  9051 |
| 331 | 02-2017 |  8889 |
| 332 | 03-2017 | 11032 |
| 333 | 04-2017 |  9330 |
| 334 | 05-2017 | 10955 |
| 335 | 06-2017 | 10217 |
| 336 | 07-2017 | 10096 |
| 337 | 08-2017 |  9837 |
| 338 | 09-2017 | 10605 |
| 339 | 10-2017 | 11500 |
| 340 | 11-2017 | 11625 |
| 341 | 12-2017 | 10556 |
| 342 | 01-2018 | 10351 |
| 343 | 02-2018 | 10573 |
| 344 | 03-2018 | 11625 |
| 345 | 04-2018 | 11224 |
| 346 | 05-2018 | 12550 |
| 347 | 06-2018 | 11652 |
| 348 | 07-2018 | 11830 |
| 349 | 08-2018 | 10752 |
| 350 | 09-2018 | 11607 |
| 351 | 10-2018 | 13045 |
| 352 | 11-2018 | 12898 |
| 353 | 12-2018 | 11837 |
| 354 | 01-2019 | 11440 |
| 355 | 02-2019 | 11010 |
|-----+---------+-------|
#+tblfm: $1=@#-1

*** number of articles per licence 
# [2019-04-18 Thu]

|-----------------------------------------------------+---------|
| licence                                             |   total |
|-----------------------------------------------------+---------|
| http://arxiv.org/licenses/nonexclusive-distrib/1.0/ | 1017997 |
| (none provided)                                     |  453077 |
| http://creativecommons.org/licenses/by/4.0/         |   10657 |
| http://creativecommons.org/licenses/by/3.0/         |    7944 |
| http://creativecommons.org/licenses/by-nc-sa/3.0/   |    5909 |
| http://creativecommons.org/licenses/by-nc-sa/4.0/   |    4617 |
| http://creativecommons.org/licenses/publicdomain/   |    2485 |
| http://creativecommons.org/publicdomain/zero/1.0/   |    1883 |
| http://creativecommons.org/licenses/by-sa/4.0/      |    1608 |
|-----------------------------------------------------+---------|

** data
*** total data size 
# [2019-04-19 Fri]

2.1T

#+BEGIN_SRC bash
# calculate disk usage across arXiv/src_all folder
du -h --max-depth 1
#+END_SRC

*** number of tar archive files
# [2019-02-04 Mo]

2150 

*** number of folders with ancillary files provided as part of upload

3343

#+BEGIN_SRC bash
# find all folders named exactly "anc"
find . -name "anc" | wc -l
#+END_SRC

** images
*** number of images extracted from pdfs

27,198,781

*** list of all different image file extensions

now in https://github.com/re-imaging/re-imaging/blob/master/arxiv-src-scripts/format_totals_final.txt 
# from [2019-02-09 Sat] pre-gz unzip

#+BEGIN_SRC bash
# command for finding files using perl
find . -type f | perl -ne 'print $1 if m/\.([^.\/]+)$/' | sort -u

# or all in one go, getting totals and writing to text file
find . -type f | grep -E ".*\.[a-zA-Z0-9]*$" | sed -e 's/.*\(\.[a-zA-Z0-9]*\)$/\1/' | sort | uniq -c | sort -n > ../format_totals_final.txt
#+END_SRC

*** number of images total

10061873  
(using find command to write each filepath into a text file)

#+BEGIN_SRC bash
# written to a paths text file
# command
find . -type f \( -iname "*.png" -o -iname "*.eps" -o -iname "*.pdf" -o -iname "*.ps" -o -iname "*.jpg" \
-o -iname "*.jpeg" -o -iname "*.pstex" -o -iname "*.gif" -o -iname "*.svg" -o -iname "*.epsf" \) \
-not -name "*pdf_image-*"
# full command in bash script image_paths_to_txt.sh
#+END_SRC

10061232  
(this is the total number of rows in the sqlite database, written via the find command)
# [2019-04-12 Fri]

*** average number of images per article

6.814069127

#+BEGIN_SRC 
10061232 / 1476538 = 6.814069127
#+END_SRC

*** average size of images
# [2019-04-12 Fri]

615 x 478 pixels

mean across the entire dataset  
614.5988512991947 x 478.21691675858534  
calculated using sqlite database

*** distribution of size of images (perhaps divisions of common resolutions 480p, 240p etc.?)

*** primary image formats

|----------+--------|
|    total | format |
|----------+--------|
|      606 | .GIF   |
|      919 | .JPEG  |
|     1386 | .PDF   |
|     3425 | .epsf  |
|     5236 | .PS    |
|     7788 | .JPG   |
|    11256 | .PNG   |
|    12404 | .svg   |
|    15182 | .epsi  |
|    18496 | .gif   |
|    24190 | .pstex |
|    25141 | .EPS   |
|    26164 | .jpeg  |
|   450816 | .jpg   |
|   905970 | .ps    |
|  1090973 | .png   |
|  3299213 | .pdf   |
|  4202415 | .eps   |
|----------+--------|
| 10101580 | total  |
|----------+--------|

*** highest number of images for a single article
# [2019-04-12 Fri]

67

article: /1804/1804.11192/

*** images by primary category 
# [2019-05-02 Thu]

171 different primary categories

| primary category   |  total | rank |
|--------------------+--------+------|
| hep-ph             | 814037 |    1 |
| astro-ph           | 742929 |    2 |
| cs.CV              | 536024 |    3 |
| astro-ph.GA        | 414296 |    4 |
| astro-ph.CO        | 394900 |    5 |
| astro-ph.SR        | 368520 |    6 |
| quant-ph           | 307949 |    7 |
| hep-th             | 287747 |    8 |
| astro-ph.HE        | 260679 |    9 |
| cond-mat.mes-hall  | 243985 |   10 |
| cond-mat.str-el    | 242199 |   11 |
| hep-ex             | 225621 |   12 |
| cond-mat.stat-mech | 208411 |   13 |
| nucl-th            | 199725 |   14 |
| gr-qc              | 195447 |   15 |
| cs.LG              | 189391 |   16 |
| math.NA            | 183991 |   17 |
| cond-mat.mtrl-sci  | 176125 |   18 |
| cond-mat.soft      | 150161 |   19 |
| cs.IT              | 148683 |   20 |
| astro-ph.EP        | 143683 |   21 |
| hep-lat            | 129076 |   22 |
| stat.ML            | 128104 |   23 |
| cond-mat.supr-con  | 126255 |   24 |
| astro-ph.IM        | 123009 |   25 |
| math.GT            | 116189 |   26 |
| physics.flu-dyn    | 112735 |   27 |
| math.OC            |  94774 |   28 |
| physics.ins-det    |  92583 |   29 |
| nucl-ex            |  87936 |   30 |
| stat.ME            |  85470 |   31 |
| cs.NI              |  82362 |   32 |
| math.CO            |  81315 |   33 |
| physics.optics     |  72789 |   34 |
| cond-mat.quant-gas |  72275 |   35 |
| physics.soc-ph     |  66901 |   36 |
| math-ph            |  65447 |   37 |
| cond-mat.dis-nn    |  64626 |   38 |
| cs.SI              |  61405 |   39 |
| cs.RO              |  61170 |   40 |
| math.DS            |  59980 |   41 |
| cs.AI              |  55324 |   42 |
| cs.DC              |  54255 |   43 |
| cs.CL              |  53137 |   44 |
| math.AP            |  49096 |   45 |
| nlin.CD            |  48426 |   46 |
| physics.atom-ph    |  48098 |   47 |
| stat.AP            |  47455 |   48 |
| math.PR            |  47398 |   49 |
| physics.comp-ph    |  46275 |   50 |
| cs.CR              |  46057 |   51 |
| physics.plasm-ph   |  45813 |   52 |
| math.ST            |  43833 |   53 |
| cs.SY              |  41649 |   54 |
| cs.DS              |  40134 |   55 |
| cs.SE              |  39910 |   56 |
| cond-mat           |  38925 |   57 |
| nlin.PS            |  37559 |   58 |
| cs.CG              |  36602 |   59 |
| cond-mat.other     |  34865 |   60 |
| physics.chem-ph    |  34722 |   61 |
| cs.DB              |  31349 |   62 |
| math.AG            |  30025 |   63 |
| q-bio.PE           |  30017 |   64 |
| physics.bio-ph     |  27860 |   65 |
| physics.acc-ph     |  27346 |   66 |
| cs.NE              |  26836 |   67 |
| math.DG            |  24935 |   68 |
| stat.CO            |  24724 |   69 |
| physics.data-an    |  24008 |   70 |
| q-bio.NC           |  22542 |   71 |
| math.QA            |  21658 |   72 |
| eess.SP            |  21086 |   73 |
| cs.IR              |  20302 |   74 |
| cs.GR              |  19099 |   75 |
| q-bio.QM           |  18591 |   76 |
| cs.CE              |  17945 |   77 |
| physics.class-ph   |  16750 |   78 |
| cs.GT              |  15922 |   79 |
| cs.DM              |  15523 |   80 |
| cs.LO              |  15016 |   81 |
| cs.NA              |  14941 |   82 |
| cs.CY              |  14680 |   83 |
| math.MG            |  14107 |   84 |
| nlin.AO            |  13874 |   85 |
| cs.HC              |  13853 |   86 |
| physics.gen-ph     |  13623 |   87 |
| physics.geo-ph     |  13167 |   88 |
| physics.ao-ph      |  13132 |   89 |
| math.GR            |  12865 |   90 |
| q-bio.MN           |  11727 |   91 |
| nlin.SI            |  11599 |   92 |
| q-fin.ST           |  11550 |   93 |
| physics.med-ph     |  11345 |   94 |
| q-bio.BM           |  11331 |   95 |
| math.SG            |  11173 |   96 |
| math.CA            |  10697 |   97 |
| cs.MM              |  10358 |   98 |
| math.NT            |  10281 |   99 |
| cs.SD              |  10012 |  100 |
| math.AT            |   9265 |  101 |
| math.RT            |   9238 |  102 |
| eess.IV            |   9033 |  103 |
| cs.PL              |   8763 |  104 |
| cs.CC              |   8591 |  105 |
| cs.ET              |   8549 |  106 |
| physics.app-ph     |   8121 |  107 |
| chao-dyn           |   7958 |  108 |
| math.CT            |   7616 |  109 |
| cs.AR              |   7272 |  110 |
| physics.space-ph   |   7037 |  111 |
| cs.MA              |   6945 |  112 |
| physics.ed-ph      |   6663 |  113 |
| math.HO            |   6652 |  114 |
| q-bio.GN           |   6492 |  115 |
| cs.PF              |   6451 |  116 |
| math.FA            |   6340 |  117 |
| math.CV            |   6208 |  118 |
| q-fin.TR           |   6145 |  119 |
| nlin.CG            |   5789 |  120 |
| cs.MS              |   5764 |  121 |
| physics.atm-clus   |   5550 |  122 |
| cs.OH              |   5514 |  123 |
| math.OA            |   5367 |  124 |
| q-bio.CB           |   5302 |  125 |
| q-fin.GN           |   5120 |  126 |
| q-fin.CP           |   5099 |  127 |
| cs.DL              |   5009 |  128 |
| q-fin.PR           |   4990 |  129 |
| math.SP            |   4888 |  130 |
| q-fin.RM           |   4480 |  131 |
| cs.FL              |   4194 |  132 |
| q-bio.TO           |   3990 |  133 |
| physics.hist-ph    |   3614 |  134 |
| q-bio.SC           |   3286 |  135 |
| econ.EM            |   3238 |  136 |
| q-fin.MF           |   3205 |  137 |
| math.RA            |   3182 |  138 |
| physics.pop-ph     |   2870 |  139 |
| q-fin.PM           |   2731 |  140 |
| math.GM            |   2650 |  141 |
| eess.AS            |   2421 |  142 |
| q-fin.EC           |   2140 |  143 |
| math.AC            |   2138 |  144 |
| patt-sol           |   2113 |  145 |
| stat.OT            |   1875 |  146 |
| math.GN            |   1757 |  147 |
| cs.OS              |   1692 |  148 |
| cs.SC              |   1638 |  149 |
| q-alg              |   1586 |  150 |
| q-bio.OT           |   1478 |  151 |
| cmp-lg             |   1346 |  152 |
| math.LO            |   1311 |  153 |
| adap-org           |   1307 |  154 |
| mtrl-th            |    659 |  155 |
| econ.GN            |    587 |  156 |
| comp-gas           |    579 |  157 |
| math.KT            |    579 |  158 |
| solv-int           |    549 |  159 |
| chem-ph            |    424 |  160 |
| alg-geom           |    419 |  161 |
| econ.TH            |    223 |  162 |
| dg-ga              |    211 |  163 |
| supr-con           |    186 |  164 |
| atom-ph            |    155 |  165 |
| acc-phys           |    119 |  166 |
| cs.GL              |    113 |  167 |
| ao-sci             |     68 |  168 |
| funct-an           |     38 |  169 |
| plasm-ph           |     37 |  170 |
| bayes-an           |     17 |  171 |
|--------------------+--------+------|
#+tblfm: $3=@#-1

*** images by month/year
# [2019-04-17 Wed]

|-----+---------+--------|
| no. |   month |  total |
|-----+---------+--------|
|   1 | 11-1988 |     11 |
|   2 | 01-1990 |      7 |
|   3 | 04-1990 |     27 |
|   4 | 05-1990 |     92 |
|   5 | 09-1990 |      4 |
|   6 | 01-1991 |      9 |
|   7 | 03-1991 |      6 |
|   8 | 04-1991 |     10 |
|   9 | 05-1991 |      1 |
|  10 | 06-1991 |      7 |
|  11 | 08-1991 |      9 |
|  12 | 09-1991 |     64 |
|  13 | 10-1991 |     39 |
|  14 | 11-1991 |      1 |
|  15 | 01-1992 |      7 |
|  16 | 02-1992 |     20 |
|  17 | 03-1992 |     19 |
|  18 | 04-1992 |    114 |
|  19 | 05-1992 |     83 |
|  20 | 06-1992 |     40 |
|  21 | 07-1992 |    103 |
|  22 | 08-1992 |     36 |
|  23 | 09-1992 |     74 |
|  24 | 10-1992 |    100 |
|  25 | 11-1992 |    188 |
|  26 | 12-1992 |    188 |
|  27 | 01-1993 |    197 |
|  28 | 02-1993 |    149 |
|  29 | 03-1993 |    269 |
|  30 | 04-1993 |    350 |
|  31 | 05-1993 |    534 |
|  32 | 06-1993 |    418 |
|  33 | 07-1993 |    531 |
|  34 | 08-1993 |    511 |
|  35 | 09-1993 |    650 |
|  36 | 10-1993 |    948 |
|  37 | 11-1993 |   1190 |
|  38 | 12-1993 |   1138 |
|  39 | 01-1994 |   1216 |
|  40 | 02-1994 |   1135 |
|  41 | 03-1994 |   1447 |
|  42 | 04-1994 |   1252 |
|  43 | 05-1994 |   1801 |
|  44 | 06-1994 |   1911 |
|  45 | 07-1994 |   1674 |
|  46 | 08-1994 |   1550 |
|  47 | 09-1994 |   1849 |
|  48 | 10-1994 |   1669 |
|  49 | 11-1994 |   2206 |
|  50 | 12-1994 |   2426 |
|  51 | 01-1995 |   2035 |
|  52 | 02-1995 |   1807 |
|  53 | 03-1995 |   2242 |
|  54 | 04-1995 |   1599 |
|  55 | 05-1995 |   1998 |
|  56 | 06-1995 |   2310 |
|  57 | 07-1995 |   1888 |
|  58 | 08-1995 |   2264 |
|  59 | 09-1995 |   2314 |
|  60 | 10-1995 |   2630 |
|  61 | 11-1995 |   2706 |
|  62 | 12-1995 |   2970 |
|  63 | 01-1996 |   3013 |
|  64 | 02-1996 |   3766 |
|  65 | 03-1996 |   3296 |
|  66 | 04-1996 |   3607 |
|  67 | 05-1996 |   4008 |
|  68 | 06-1996 |   4201 |
|  69 | 07-1996 |   4397 |
|  70 | 08-1996 |   4893 |
|  71 | 09-1996 |   4578 |
|  72 | 10-1996 |   5464 |
|  73 | 11-1996 |   5054 |
|  74 | 12-1996 |   4807 |
|  75 | 01-1997 |   5076 |
|  76 | 02-1997 |   4974 |
|  77 | 03-1997 |   4648 |
|  78 | 04-1997 |   5659 |
|  79 | 05-1997 |   5973 |
|  80 | 06-1997 |   6467 |
|  81 | 07-1997 |   7656 |
|  82 | 08-1997 |   5846 |
|  83 | 09-1997 |   6970 |
|  84 | 10-1997 |   7753 |
|  85 | 11-1997 |   7193 |
|  86 | 12-1997 |   7498 |
|  87 | 01-1998 |   6772 |
|  88 | 02-1998 |   6410 |
|  89 | 03-1998 |   7823 |
|  90 | 04-1998 |   7187 |
|  91 | 05-1998 |   8224 |
|  92 | 06-1998 |   9845 |
|  93 | 07-1998 |   8757 |
|  94 | 08-1998 |   7459 |
|  95 | 09-1998 |  10178 |
|  96 | 10-1998 |   9632 |
|  97 | 11-1998 |   9564 |
|  98 | 12-1998 |   9811 |
|  99 | 01-1999 |   8296 |
| 100 | 02-1999 |   8569 |
| 101 | 03-1999 |  11452 |
| 102 | 04-1999 |   9233 |
| 103 | 05-1999 |   9829 |
| 104 | 06-1999 |  10328 |
| 105 | 07-1999 |  10859 |
| 106 | 08-1999 |   9508 |
| 107 | 09-1999 |  10635 |
| 108 | 10-1999 |  10783 |
| 109 | 11-1999 |  11561 |
| 110 | 12-1999 |  11136 |
| 111 | 01-2000 |  10807 |
| 112 | 02-2000 |  10987 |
| 113 | 03-2000 |  11485 |
| 114 | 04-2000 |   9327 |
| 115 | 05-2000 |  12045 |
| 116 | 06-2000 |  11373 |
| 117 | 07-2000 |  11610 |
| 118 | 08-2000 |  11651 |
| 119 | 09-2000 |  10320 |
| 120 | 10-2000 |  12712 |
| 121 | 11-2000 |  12927 |
| 122 | 12-2000 |  12616 |
| 123 | 01-2001 |  11486 |
| 124 | 02-2001 |  11007 |
| 125 | 03-2001 |  12499 |
| 126 | 04-2001 |  11294 |
| 127 | 05-2001 |  13199 |
| 128 | 06-2001 |  13272 |
| 129 | 07-2001 |  13760 |
| 130 | 08-2001 |  11189 |
| 131 | 09-2001 |  12099 |
| 132 | 10-2001 |  14776 |
| 133 | 11-2001 |  13647 |
| 134 | 12-2001 |  12547 |
| 135 | 01-2002 |  13086 |
| 136 | 02-2002 |  11750 |
| 137 | 03-2002 |  13358 |
| 138 | 04-2002 |  14205 |
| 139 | 05-2002 |  14542 |
| 140 | 06-2002 |  13629 |
| 141 | 07-2002 |  16789 |
| 142 | 08-2002 |  12860 |
| 143 | 09-2002 |  14776 |
| 144 | 10-2002 |  15823 |
| 145 | 11-2002 |  16046 |
| 146 | 12-2002 |  14949 |
| 147 | 01-2003 |  14805 |
| 148 | 02-2003 |  14005 |
| 149 | 03-2003 |  14668 |
| 150 | 04-2003 |  14256 |
| 151 | 05-2003 |  16013 |
| 152 | 06-2003 |  16509 |
| 153 | 07-2003 |  17312 |
| 154 | 08-2003 |  14161 |
| 155 | 09-2003 |  17667 |
| 156 | 10-2003 |  18252 |
| 157 | 11-2003 |  16043 |
| 158 | 12-2003 |  17114 |
| 159 | 01-2004 |  15250 |
| 160 | 02-2004 |  17099 |
| 161 | 03-2004 |  17894 |
| 162 | 04-2004 |  16465 |
| 163 | 05-2004 |  17854 |
| 164 | 06-2004 |  20144 |
| 165 | 07-2004 |  18503 |
| 166 | 08-2004 |  17117 |
| 167 | 09-2004 |  19438 |
| 168 | 10-2004 |  20612 |
| 169 | 11-2004 |  20161 |
| 170 | 12-2004 |  20131 |
| 171 | 01-2005 |  17608 |
| 172 | 02-2005 |  16486 |
| 173 | 03-2005 |  19846 |
| 174 | 04-2005 |  19527 |
| 175 | 05-2005 |  19122 |
| 176 | 06-2005 |  22451 |
| 177 | 07-2005 |  21567 |
| 178 | 08-2005 |  18794 |
| 179 | 09-2005 |  22753 |
| 180 | 10-2005 |  23208 |
| 181 | 11-2005 |  21318 |
| 182 | 12-2005 |  21203 |
| 183 | 01-2006 |  19489 |
| 184 | 02-2006 |  17896 |
| 185 | 03-2006 |  23669 |
| 186 | 04-2006 |  18828 |
| 187 | 05-2006 |  21587 |
| 188 | 06-2006 |  21854 |
| 189 | 07-2006 |  22494 |
| 190 | 08-2006 |  21812 |
| 191 | 09-2006 |  24613 |
| 192 | 10-2006 |  25578 |
| 193 | 11-2006 |  26112 |
| 194 | 12-2006 |  22846 |
| 195 | 01-2007 |  23661 |
| 196 | 02-2007 |  21987 |
| 197 | 03-2007 |  23706 |
| 198 | 04-2007 |  22485 |
| 199 | 05-2007 |  25668 |
| 200 | 06-2007 |  24426 |
| 201 | 07-2007 |  25360 |
| 202 | 08-2007 |  24225 |
| 203 | 09-2007 |  26571 |
| 204 | 10-2007 |  31672 |
| 205 | 11-2007 |  27463 |
| 206 | 12-2007 |  25980 |
| 207 | 01-2008 |  27561 |
| 208 | 02-2008 |  25120 |
| 209 | 03-2008 |  25970 |
| 210 | 04-2008 |  27261 |
| 211 | 05-2008 |  27428 |
| 212 | 06-2008 |  28252 |
| 213 | 07-2008 |  29978 |
| 214 | 08-2008 |  25154 |
| 215 | 09-2008 |  30985 |
| 216 | 10-2008 |  35081 |
| 217 | 11-2008 |  28507 |
| 218 | 12-2008 |  30994 |
| 219 | 01-2009 |  29999 |
| 220 | 02-2009 |  27152 |
| 221 | 03-2009 |  31566 |
| 222 | 04-2009 |  28030 |
| 223 | 05-2009 |  30822 |
| 224 | 06-2009 |  34584 |
| 225 | 07-2009 |  35045 |
| 226 | 08-2009 |  31141 |
| 227 | 09-2009 |  35056 |
| 228 | 10-2009 |  36168 |
| 229 | 11-2009 |  33965 |
| 230 | 12-2009 |  34971 |
| 231 | 01-2010 |  32916 |
| 232 | 02-2010 |  30680 |
| 233 | 03-2010 |  34933 |
| 234 | 04-2010 |  34588 |
| 235 | 05-2010 |  34520 |
| 236 | 06-2010 |  37563 |
| 237 | 07-2010 |  34320 |
| 238 | 08-2010 |  33145 |
| 239 | 09-2010 |  38881 |
| 240 | 10-2010 |  39270 |
| 241 | 11-2010 |  42457 |
| 242 | 12-2010 |  38161 |
| 243 | 01-2011 |  37872 |
| 244 | 02-2011 |  35109 |
| 245 | 03-2011 |  40708 |
| 246 | 04-2011 |  35983 |
| 247 | 05-2011 |  38638 |
| 248 | 06-2011 |  40226 |
| 249 | 07-2011 |  41267 |
| 250 | 08-2011 |  41337 |
| 251 | 09-2011 |  46899 |
| 252 | 10-2011 |  46266 |
| 253 | 11-2011 |  48216 |
| 254 | 12-2011 |  44847 |
| 255 | 01-2012 |  42370 |
| 256 | 02-2012 |  44005 |
| 257 | 03-2012 |  45168 |
| 258 | 04-2012 |  43510 |
| 259 | 05-2012 |  46642 |
| 260 | 06-2012 |  47912 |
| 261 | 07-2012 |  48265 |
| 262 | 08-2012 |  46157 |
| 263 | 09-2012 |  45269 |
| 264 | 10-2012 |  53842 |
| 265 | 11-2012 |  49689 |
| 266 | 12-2012 |  48001 |
| 267 | 01-2013 |  48995 |
| 268 | 02-2013 |  45883 |
| 269 | 03-2013 |  52934 |
| 270 | 04-2013 |  51476 |
| 271 | 05-2013 |  50673 |
| 272 | 06-2013 |  50448 |
| 273 | 07-2013 |  62295 |
| 274 | 08-2013 |  52996 |
| 275 | 09-2013 |  71950 |
| 276 | 10-2013 |  61687 |
| 277 | 11-2013 |  55479 |
| 278 | 12-2013 |  54234 |
| 279 | 01-2014 |  55454 |
| 280 | 02-2014 |  53244 |
| 281 | 03-2014 |  61297 |
| 282 | 04-2014 |  55829 |
| 283 | 05-2014 |  60058 |
| 284 | 06-2014 |  57758 |
| 285 | 07-2014 |  66888 |
| 286 | 08-2014 |  55138 |
| 287 | 09-2014 |  63416 |
| 288 | 10-2014 |  65598 |
| 289 | 11-2014 |  65634 |
| 290 | 12-2014 |  68876 |
| 291 | 01-2015 |  61961 |
| 292 | 02-2015 |  61664 |
| 293 | 03-2015 |  72438 |
| 294 | 04-2015 |  68725 |
| 295 | 05-2015 |  70703 |
| 296 | 06-2015 |  73845 |
| 297 | 07-2015 |  70855 |
| 298 | 08-2015 |  64263 |
| 299 | 09-2015 |  76662 |
| 300 | 10-2015 |  75521 |
| 301 | 11-2015 |  84480 |
| 302 | 12-2015 |  76998 |
| 303 | 01-2016 |  72871 |
| 304 | 02-2016 |  74819 |
| 305 | 03-2016 |  87150 |
| 306 | 04-2016 |  78843 |
| 307 | 05-2016 |  86293 |
| 308 | 06-2016 |  95666 |
| 309 | 07-2016 |  77832 |
| 310 | 08-2016 |  75794 |
| 311 | 09-2016 |  85315 |
| 312 | 10-2016 |  88463 |
| 313 | 11-2016 |  93998 |
| 314 | 12-2016 |  86732 |
| 315 | 01-2017 |  75725 |
| 316 | 02-2017 |  76541 |
| 317 | 03-2017 |  99462 |
| 318 | 04-2017 |  88333 |
| 319 | 05-2017 |  99221 |
| 320 | 06-2017 |  90892 |
| 321 | 07-2017 |  90875 |
| 322 | 08-2017 |  91564 |
| 323 | 09-2017 |  99620 |
| 324 | 10-2017 | 104697 |
| 325 | 11-2017 | 107585 |
| 326 | 12-2017 | 105499 |
| 327 | 01-2018 |  94672 |
| 328 | 02-2018 | 102907 |
| 329 | 03-2018 | 110683 |
| 330 | 04-2018 | 112673 |
| 331 | 05-2018 | 117354 |
| 332 | 06-2018 | 109180 |
| 333 | 07-2018 | 114857 |
| 334 | 08-2018 | 110967 |
| 335 | 09-2018 | 111968 |
| 336 | 10-2018 | 128121 |
| 337 | 11-2018 | 130495 |
| 338 | 12-2018 | 120037 |
|-----+---------+--------|
#+tblfm: $1=@#-1

*** images by image format 
# [2019-04-12 Fri]

as determined by the ImageMagick identify command

|------+--------+---------|
| rank | format |   total |
|------+--------+---------|
|    1 | PS     | 5149324 |
|    2 | PDF    | 3261411 |
|    3 | PNG    | 1079044 |
|    4 | JPEG   |  484113 |
|    5 | GIF    |   18742 |
|    6 | PDF612 |   13083 |
|    7 | SVG    |   12407 |
|    8 | PDF595 |    9874 |
|    9 |        |    8117 |
|   10 | PS360  |    1967 |
|   11 | PS612  |    1688 |
|   12 | EPS    |    1643 |
|   13 | PS596  |    1099 |
|   14 | PDF504 |     709 |
|   15 | PDF360 |     644 |
|   16 | PDF842 |     602 |
|   17 | PS504  |     563 |
|------+--------+---------|
#+tblfm: $1=@#-1
